Revit 2026 API

# FieldBuilder Class

---

This class is used to create Fields in the Extensible Storage framework.

SystemObject Autodesk.Revit.DB.ExtensibleStorageFieldBuilder

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FieldBuilder : IDisposable
```
```vb
Public Class FieldBuilder
	Implements IDisposable
```
```cpp
public ref class FieldBuilder : IDisposable
```
```fsharp
type FieldBuilder =
    class
        interface IDisposable
    end
```

The FieldBuilder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FieldBuilder(FieldBuilder) | Constructs a new copy of the input ESFieldBuilder object. |
|  | FieldBuilder(Field, SchemaBuilder) | Constructs a new FieldBuilder using the field and associated SchemaBuilder object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FieldBuilder |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | NeedsSubSchemaGUID | Checks whether the SubSchema GUID needs to be explicitly specified for this field type. |
|  | NeedsUnits | Checks whether the field type requires explicit unit conversions. |
|  | Ready | Checks whether the builder may be used. |
|  | SetDocumentation | Sets the documentation string for the Field. |
|  | SetSpec | Sets the spec describing the field's values. |
|  | SetSubSchemaGUID | Sets the GUID of the Schema of the Entities that are intended to be stored in this field. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.ExtensibleStorage Namespace